Repository: BabelWeb/tutoriels
Catalog: Custom Post Types/i18n/custom-post-type-ui-*.po
Languages: fr_fr

source: If you have sought support for Custom Post Type UI on the forums, you may be requested to send the information below to the plugin developer. Simply insert the email they provided in the input field at the bottom and click the "Send debug info" button. Only the data below will be sent to them.
fr_fr: Si vous avez demandé un support pour Custom Post Type UI sur les forums, vous pouvez être invité à envoyer les informations ci-dessous pour le développeur du plugin. Il suffit d'insérer l'email qu'ils ont fourni dans le champ de saisie en bas de page et cliquez sur le bouton "Envoyer les informations de débogage". Seules les données ci-dessous seront envoyées.

source: CPTUI debug information for %s
fr_fr: CPTUI informations de débogage pour %s

source: Custom Post Types
fr_fr: Les types personnalisés d'article

source: Add/Edit Post Types
fr_fr: Ajouter / Modifier les types d'article

source: Add/Edit Taxonomies
fr_fr: Ajouter / Modifier les taxonomies

source: Registered Types and Taxes
fr_fr: Les types et les taxonomies enregistrés

source: Registered Types/Taxes
fr_fr: Types/Taxonomies enregistrés

source: Help/Support
fr_fr: Aide/Support

source: About CPT UI
fr_fr: À propos de CPT UI

source: %s has been successfully added
fr_fr: %s a été ajouté avec succès

source: %s has failed to be added
fr_fr: %s a échoué dans son ajout

source: %s has been successfully updated
fr_fr: %s a été mis à jour avec succès

source: %s has failed to be updated
fr_fr: %s a échoué dans sa mise à jour

source: %s has been successfully deleted
fr_fr: %s a été supprimé avec succès

source: %s has failed to be deleted
fr_fr: %s a échoué dans sa suppression

source: %s has been successfully imported
fr_fr: %s a été importé avec succès

source: %s has failed to be imported
fr_fr: %s a échoué dans son importation

source: Add new %s
fr_fr: Ajouter un nouveau %s

source: Edit %s
fr_fr: Modifier %s

source: New %s
fr_fr: Nouveau %s

source: View %s
fr_fr: Voir %s

source: All %s
fr_fr: Tous les %s

source: Search %s
fr_fr: Rechercher %s

source: No %s found.
fr_fr: Aucun %s trouvé

source: No %s found in trash.
fr_fr: Aucun %s trouvé dans la poubelle

source: Popular %s
fr_fr: %s Populaire

source: Parent %s
fr_fr: %s parent

source: Parent %s:
fr_fr: %s parent :

source: Update %s
fr_fr: Mise à jour %s

source: New %s name
fr_fr: Nouveau nom %s

source: Separate %s with commas
fr_fr: Séparez les %s par des virgules

source: Add or remove %s
fr_fr: Ajouter ou retirer des %s

source: Choose from the most used %s
fr_fr: Choisir parmi les %s les plus utilisés

source: Thank you for choosing Custom Post Type UI. We hope that your experience with our plugin provides efficiency and speed in creating post types and taxonomies, to better organize your content, without having to touch code.
fr_fr: Merci d'avoir choisi Custom Post Type UI. Nous espérons que notre plugin vous fournira efficacité et rapidité dans la création de types d'article et de taxonomies, pour mieux organiser votre contenu, sans avoir à toucher au code.

source: What's new in version %s
fr_fr: Quoi de nouveau dans la version %s

source: Evolved UI for Custom Post Type UI
fr_fr: Interface Utilisateur (UI) évoluée pour Custom Post Type UI

source: We have further revised our UI for post type and taxonomy parameter screens. Better separation of required and optional settings was a primary goal as well as user flow through the screen.
fr_fr: Nous avons en outre révisé notre interface utilisateur pour les écrans des paramètres pour le type d'article et la taxonomie. Une meilleure séparation des paramètres, requis ou facultatifs, était un des principaux objectifs ainsi que le déplacement de l'utilisateur sur cet écran.

source: Slug prevention measures
fr_fr: Mesures de prévention pour les slugs

source: We added measures on the post type and taxonomy slug inputs to prevent using characters that should not be used in slugs. This is primarily for when adding new post types and taxonomies, but will also affect when editing existing options. Do not hesitate to contact support if you are experiencing issues.
fr_fr: Nous avons ajouté des mesures sur les saisies de slug pour les types d'article et les taxonomies afin d'empêcher l'utilisation de caractères qui ne doivent pas être utilisés dans les slugs. Ces mesures agissent principalement lors de l'ajout de nouveaux types d'article ou de taxonomies, mais elles auront également une incidence lors de l'édition des options existantes. N'hésitez pas à contacter le support si vous rencontrez des problèmes.

source: Improved rewrite rules flushing
fr_fr: Amélioration des régles de réécriture

source: We improved what we do after registering a new post type or taxonomy to better prevent having to manually flush rewrite rules.
fr_fr: Nous avons amélioré ce que nous faisons après l'enregistrement d'un nouveau type d'article ou de taxonomie afin d'éviter des règles de réécriture à lancer manuellement.

source: Continued accessibility improvements
fr_fr: Amélioration de l'accessibilité - suite

source: We have continued working on the accessibility of the plugin, building off what we accomplished in previous releases. If you have feedback on where it could be further improved, let us know.
fr_fr: Nous avons continué à travailler sur l'accessibilité du plugin en dehors de ce que nous avons accompli dans les versions précédentes. Si vous avez des commentaires sur l'endroit où il pourrait être encore améliorée, faites le nous savoir.

source: More parameter and label support
fr_fr: Plus de support sur les paramètres ou les libellés

source: We have added more parameters as well as recently added labels for greater customization of your post type and taxonomy settings.
fr_fr: Nous avons récemment ajouté plusieurs paramètres ainsi que des étiquettes pour une plus grande personnalisation des paramètres de votre type d'article et de la taxonomie.

source: Default "supports" for post types
fr_fr: "supports" par défaut pour les types d'article

source: The "Title", "Editor", and "Featured Image" checkboxes are now checked by default when adding a new post type.
fr_fr: Les cases à cocher "Titre", "Editeur" et "Image à la Une" sont maintenant cochés par défaut quand vous ajouter un nouveau type d'article.

source: Help Support This Plugin!
fr_fr: Aidez le support de ce plugin !

source: Professional WordPress<br />Third Edition
fr_fr: WordPress Professionnel<br />Troisième édition

source: The leading book on WordPress design and development! Brand new third edition!
fr_fr: Le livre de premier plan sur la conception et le développement de WordPress ! Nouvelle troisième édition !

source: Professional WordPress<br />Plugin Development
fr_fr: WordPress Professionel<br />Développement de plugin

source: Highest rated WordPress development book on Amazon!
fr_fr: Livre de développement WordPress mieux noté sur Amazon !

source: PayPal Donation
fr_fr: Donation PayPal

source: Please donate to the development of Custom Post Type UI:
fr_fr: Veuillez faire un don pour le développement de Custom Post UI :

source: Post Types
fr_fr: Les types d'article

source: Taxonomies
fr_fr: Les taxonomies

source: Get Code
fr_fr: Obtenir le code

source: Debug Info
fr_fr: Informations de débogage

source: No taxonomies to display at this time
fr_fr: Aucune taxonomie à afficher pour le moment

source: No post types to display at this time
fr_fr: Aucun type d'article à afficher pour le moment

source: Post types
fr_fr: Les types d'article

source: If you are wanting to migrate registered post types or taxonomies from this site to another, that will also use Custom Post Type UI, use the import and export functionality. If you are moving away from Custom Post Type UI, use the information in the "Get Code" tab.
fr_fr: Si vous souhaitez migrer les types d'article ou les taxonomies enregistrés de ce site vers un autre, qui utilise également Custom Type Message UI, utilisez la fonctionnalité d'importation et d'exportation. Si vous vous éloignez de Custom Post Type UI, utilisez les informations dans l'onglet "Obtenir le code".

source: This will not export the associated posts or taxonomy terms, just the settings.
fr_fr: Ceci n'exportera pas les termes associés aux types d'article ou taxonomies mais seulement les paramètres.

source: Import Post Types
fr_fr: Importer les type d'article

source: Importing will overwrite previous registered settings.
fr_fr: L'importation supprimera les paramètres précèdemment enregistrés.

source: To import post types from a different WordPress site, paste the exported content from that site and click the "Import" button.
fr_fr: Pour importer les types d'article à partir d'un site WordPress différent, collez le contenu exporté depuis ce site et cliquez sur le bouton "Importer".

source: Export Post Types
fr_fr: Exporter les types d'article

source: No post types registered yet.
fr_fr: Aucun type d'article n'est déjà enregistré.

source: Use the content above to import current post types into a different WordPress site. You can also use this to simply back up your post type settings.
fr_fr: Utilisez le contenu ci-dessus pour importer les types d'article actuels dans un site WordPress différent. Vous pouvez également l'utiliser pour simplement sauvegarder vos paramètres de type d'article.

source: Import Taxonomies
fr_fr: Importer les taxonomies

source: To import taxonomies from a different WordPress site, paste the exported content from that site and click the "Import" button.
fr_fr: Pour importer les taxonomies à partir d'un site WordPress différent, collez le contenu exporté depuis ce site et cliquez sur le bouton "Importer".

source: Export Taxonomies
fr_fr: Exporter les taxonomies

source: No taxonomies registered yet.
fr_fr: Aucun taxonomie n'est déjà enregistrée.

source: Use the content above to import current taxonomies into a different WordPress site. You can also use this to simply back up your taxonomy settings.
fr_fr: Utilisez le contenu ci-dessus pour importer les taxonomies actuelles dans un site WordPress différent. Vous pouvez également l'utiliser pour simplement sauvegarder vos paramètres de taxonomies.

source: Get Post Type and Taxonomy Code
fr_fr: Obtenir le code pour les types d'article et les taxonomies

source: All CPT UI Post Types
fr_fr: Tous les types d'article de CPT UI

source: Copy/paste the code below into your functions.php file.
fr_fr: Copier/coller le code ci-dessous dans votre fichier functions.php.

source: %s Post Type
fr_fr: Type d'article %s

source: All CPT UI Taxonomies
fr_fr: Toutes les taxonomies de CPT UI

source: %s Taxonomy
fr_fr: Taxonomie %s

source: Please provide an email address to send debug information to:
fr_fr: Veuillez fournir une adresse email pour envoyer les informations de débogage :

source: Send debug info
fr_fr: Envoyer les informations de débogage

source: Post Types and Taxonomies registered by Custom Post Type UI.
fr_fr: Les types d'article et les taxonomies enregistrés par Custom Post Type UI.

source: Total count: %d
fr_fr: Total : %d

source: Post Type
fr_fr: Type d'article

source: Settings
fr_fr: Paramètres

source: Labels
fr_fr: Libellés

source: Template Hierarchy
fr_fr: Hiérarchie de template

source: View frontend archive
fr_fr: Voir les archives sur le site

source: No custom labels to display
fr_fr: Aucun libellé personnalisé à afficher

source: Archives file name examples.
fr_fr: Exemples de nom de fichier pour les archives.

source: Single Posts file name examples.
fr_fr: Exemples de nom de fichier pour les Articles seuls (single posts)

source: Taxonomy
fr_fr: Taxonomie

source: *Replace "term_slug" with the slug of the actual taxonomy term.
fr_fr: *Remplacer "term_slug" par le slug du terme de la taxonomie actuelle.

source: No post types registered for display. Visit %s to get started.
fr_fr: Aucun type d'article enregistré à afficher. Visitez %s pour commencer.

source: No taxonomies registered for display. Visit %s to get started.
fr_fr: Aucune taxonomie enregistrée à afficher. Visitez %s pour commencer.

source: Are you sure you want to delete this? Deleting will NOT remove created content.
fr_fr: Êtes-vous sûr de vouloir supprimer ceci ? La suppression ne détruira pas le contenu créé.

source: Manage Post Types
fr_fr: Gérer les types d'article

source: Add New Post Type
fr_fr: Ajouter un nouveau type de Post

source: Edit Post Types
fr_fr: Modifier les types d'article

source: View Post Types
fr_fr: Voir les types d'article

source: Select:
fr_fr: Sélectionner :

source: Select
fr_fr: Sélectionner

source: Basic settings
fr_fr: Paramètres de base

source: Post Type Slug
fr_fr: Slug du type d'article

source: The post type name/slug. Used for various queries for post type content.
fr_fr: Le slug ou le nom d'un type d'article. Utilisé dans de nombreuses requêtes pour le contenu d'un type d'article.

source: Slugs should only contain alphanumeric, latin characters. Underscores or dashes should be used in place of spaces.
fr_fr: Les slugs ne devraient contenir que des caractères latins et alphanumériques. Des tirets ou des soulignements doivent être utilisés à la place des espaces.

source: DO NOT EDIT the post type slug unless also planning to migrate posts. Changing the slug registers a new post type entry.
fr_fr: NE PAS MODIFIER le slug d'un type d'article à moins de planifier également une migration des articles. La modification du slug enregistre une nouvelle entrée de type d'article.

source: Migrate posts to newly renamed post type?
fr_fr: Migrer les articles vers le type d'article nouvellement renommé ?

source: Plural Label
fr_fr: Libellé au pluriel

source: (e.g. Movies)
fr_fr: (e.g. Films)

source: Used for the post type admin menu item.
fr_fr: Utilisé pour l'item de menu d'administration pour le type d'article.

source: Singular Label
fr_fr: Libellé au singulier

source: (e.g. Movie)
fr_fr: (e.g. Film)

source: Used when a singular label is needed.
fr_fr: Utilisé quand un libellé au singulier est nécessaire.

source: Save Post Type
fr_fr: Sauvegarder les types d'article

source: Delete Post Type
fr_fr: Supprimer les types d'article

source: Add Post Type
fr_fr: Ajouter les types d'article

source: Edit additional labels
fr_fr: Modifier les libellés supplémentaires

source: Additional labels
fr_fr: Libellés supplémentaires

source: Post Type Description
fr_fr: Description du type d'article

source: Perhaps describe what your custom post type is used for?
fr_fr: Décrit peut-être ce à quoi votre type d'article personnalisé est destiné ?

source: Menu Name
fr_fr: Nom du menu

source: Custom admin menu name for your custom post type.
fr_fr: Personnaliser le nom du menu dans l'admin pour votre type d'article personnalisé

source: (e.g. My Movies)
fr_fr: (e.g. Mes films)

source: All Items
fr_fr: Tous les items

source: Used in the post type admin submenu.
fr_fr: Utilisé dans le sous-menu administratif du type d'article

source: (e.g. All Movies)
fr_fr: (e.g. Tous les films)

source: Add New
fr_fr: Ajouter un nouveau

source: (e.g. Add New)
fr_fr: (e.g. Ajouter nouveau)

source: Add New Item
fr_fr: Ajouter un nouvel item

source: Used at the top of the post editor screen for a new post type post.
fr_fr: Utilisé en haut de l'écran d'édition de l'article pour un nouveau type d'article.

source: (e.g. Add New Movie)
fr_fr: (e.g. Ajouter un nouveau film)

source: Edit Item
fr_fr: Modifier un item

source: Used at the top of the post editor screen for an existing post type post.
fr_fr: Utilisé en haut de l'écran d'édition de l'article pour un type d'article déjà existant.

source: (e.g. Edit Movie)
fr_fr: (e.g. Modifier un item)

source: New Item
fr_fr: Nouvel item

source: Post type label. Used in the admin menu for displaying post types.
fr_fr: Libellé du type d'article. Utilisé dans le menu admin pour afficher les types d'article.

source: (e.g. New Movie)
fr_fr: (e.g. Nouveau film)

source: View Item
fr_fr: Voir un item

source: Used in the admin bar when viewing editor screen for a published post in the post type.
fr_fr: Utilisé dans la barre admin quand l'écran de l'éditeur est en train de visualiser un article publié dans le type d'article.

source: (e.g. View Movie)
fr_fr: (e.g. Voir un film)

source: Search Item
fr_fr: Recherche d'un item

source: Used as the text for the search button on post type list screen.
fr_fr: Utilisé comme texte pour le bouton de recherche sur l'écran qui liste les types d'article.

source: (e.g. Search Movie)
fr_fr: (e.g. Recherche d'un film)

source: Not Found
fr_fr: Pas trouvé

source: Used when there are no posts to display on the post type list screen.
fr_fr: Utilisé quand il n'y a pas d'article à afficher sur l'écran qui liste les types d'article.

source: (e.g. No Movies found)
fr_fr: (e.g. Aucun film trouvé)

source: Not Found in Trash
fr_fr: Pas trouvé dans la poubelle

source: Used when there are no posts to display on the post type list trash screen.
fr_fr: Utilisé quand il n'y a pas d'article à afficher sur l'écran qui liste les types d'article dans la poubelle.

source: (e.g. No Movies found in Trash)
fr_fr: (e.g. Aucun film trouvé dans la poubelle)

source: (e.g. Parent Movie)
fr_fr: (e.g. Film parent)

source: Featured Image
fr_fr: Image à la Une

source: Used as the "Featured Image" phrase for the post type.
fr_fr: Utilisé comme la phrase "Image à la Une" pour le type d'article.

source: (e.g. Featured image for this movie)
fr_fr: (e.g. Image à la Une pour ce film)

source: Set Featured Image
fr_fr: Mettre une image à la Une

source: Used as the "Set featured image" phrase for the post type.
fr_fr: Utilisé comme la phrase "Mettre une Image à la Une" pour le type d'article.

source: (e.g. Set featured image for this movie)
fr_fr: (e.g. Mettre une image à la Une pour ce film)

source: Remove Featured Image
fr_fr: Retirer une image à la Une

source: Used as the "Remove featured image" phrase for the post type.
fr_fr: Utilisé comme la phrase "Retirer l'image à la Une" pour le type d'article.

source: (e.g. Remove featured image for this movie)
fr_fr: (e.g. Retirer une image à la Une pour ce film)

source: Use Featured Image
fr_fr: Utiliser une image à la Une

source: Used as the "Use as featured image" phrase for the post type.
fr_fr: Utilisé comme la phrase "Utiliser l'image à la Une" pour le type d'article.

source: (e.g. Use as featured image for this movie)
fr_fr: (e.g. Utiliser une image à la Une pour ce film)

source: Post type archive label used in nav menus.
fr_fr: Libellé d'une archive du type d'article utilisé dans les menus de navigation.

source: (e.g. Movie archives)
fr_fr: (e.g. Les archives de film)

source: Insert into item
fr_fr: Insérer dans un item

source: Used as the "Insert into post" or "Insert into page" phrase for the post type.
fr_fr: Utilisé comme la phrase "Insérer dans l'article" pour le type d'article.

source: (e.g. Insert into movie)
fr_fr: (e.g. Insérer dans un film)

source: Uploaded to this Item
fr_fr: Téléchargé pour cet item

source: Used as the "Uploaded to this post" or "Uploaded to this page" phrase for the post type.
fr_fr: Utilisé comme la phrase "Téléchargé pour cet article" ou "Téléchargé pour cette page" pour le type d'article.

source: (e.g. Uploaded to this movie)
fr_fr: (e.g. Téléchargé pour ce film)

source: Filter Items List
fr_fr: Filtrer la liste des items

source: Screen reader text for the filter links heading on the post type listing screen.
fr_fr: Texte pour les lecteurs d'écran pour le titre de l'écran qui liste les types d'article.

source: (e.g. Filter movies list)
fr_fr: (e.g. Filtrer la liste des films)

source: Items List Navigation
fr_fr: Navigation dans la liste des items

source: Screen reader text for the pagination heading on the post type listing screen.
fr_fr: Texte pour les lecteurs d'écran pour la pagination de l'écran qui liste les types d'article.

source: (e.g. Movies list navigation)
fr_fr: (e.g. Navigation dans la liste des films)

source: Items List
fr_fr: Liste des items

source: Screen reader text for the items list heading on the post type listing screen.
fr_fr: Texte pour les lecteurs d'écran pour le titre de la liste des items dans l'écran qui liste les types d'article.

source: (e.g. Movies list)
fr_fr: (e.g. Liste des films)

source: Edit settings
fr_fr: Modifier les paramètres

source: False
fr_fr: Faux

source: True
fr_fr: Vrai

source: (CPTUI default: true)
fr_fr: (CPTUI par défaut : vrai)

source: WordPress core defaults to false. CPTUI defaults to true for user sake. Whether posts of this type should be shown in the admin UI and is publicly queryable.
fr_fr: Le cœur de WordPress met par défaut à faux. CPTUI met par défaut à vrai pour l'intérêt de l'utilisateur. Au cas où les articles de ce type doivent être affichés dans l'interface administrative et interrogeable publiquement.

source: Show UI
fr_fr: Générer une interface d'édition

source: (default: true)
fr_fr: (par défaut : vrai)

source: Whether to generate a default UI for managing this post type.
fr_fr: Il s'agit de générer un interface par défaut pour la gestion de ce type d'article.

source: Show in Nav Menus
fr_fr: Générer une interface dans les menus de navigation

source: Whether post type is available for selection in navigation menus.
fr_fr: Au cas où le type d'article est disponible pour la sélection dans les menus de navigation.

source: Show in REST API
fr_fr: Générer une interface dans l'API REST

source: (default: false)
fr_fr: (par défault : faux)

source: Whether to show this post type data in the WP REST API.
fr_fr: Dans le cas où l'on veut afficher les données de ce type d'article dans l'API WP REST.

source: REST API base slug
fr_fr: Slug de base pour l'API REST

source: Slug to use in REST API URLs.
fr_fr: Slug à utiliser dans les URLs de l'API REST.

source: Has Archive
fr_fr: Possède des archives

source: Whether the post type will have a post type archive URL.
fr_fr: Dans le cas où il y aurait une URL d'archive pour ce type d'article.

source: If left blank, the archive slug will default to the post type slug.
fr_fr: Si cette zone est laissée à vide, le slug de l'archive prendra par défaut le slug du type d'article

source: Slug to be used for archive URL.
fr_fr: Slug à utiliser pour l'URL de l'archive

source: Exclude From Search
fr_fr: A exclure de la recherche

source: Whether to exclude posts with this post type from front end search results.
fr_fr: Dans le cas où l'on exclurait ces types d'article des résultats de recherche depuis le site web.

source: Capability Type
fr_fr: Capacités (Capability Type)

source: The post type to use for checking read, edit, and delete capabilities
fr_fr: Le type d'article à utiliser pour vérifier les capacités de lecture, écriture et suppression.

source: Hierarchical
fr_fr: Hiérarchique

source: Whether the post type can have parent-child relationships
fr_fr: Dans le cas où le type d'article peut avoir une relation parent-enfant

source: Rewrite
fr_fr: Réécriture d'URL

source: Whether or not WordPress should use rewrites for this post type
fr_fr: Dans le cas où WordPress utilise ou pas la réécriture d'URL pour ce type d'article

source: Custom Rewrite Slug
fr_fr: Personnaliser le slug pour la réécriture d'URL

source: (default: post type slug)
fr_fr: (par défaut : le slug du type d'article)

source: Custom post type slug to use instead of the default.
fr_fr: Personnalise le slug du type d'article et remplace celui par défaut.

source: With Front
fr_fr: Avec le front office

source: Should the permastruct be prepended with the front base.
fr_fr: La structure du permalien devrait être préfixé avec cette base.

source: Query Var
fr_fr: Variable de query

source: Sets the query_var key for this post type.
fr_fr: Définit la clé du query_var pour ce type d'article.

source: Custom Query Var Slug
fr_fr: Personnaliser le slug comme variable de query
