Repository: BabelWeb/tutoriels
Catalog: Custom Post Types/i18n/custom-post-type-ui-*.po
Languages: fr_fr

source: (default: post type slug) Query var needs to be true to use.
fr_fr: (par défaut : le slug du type d'article) La variable de query doit être à vrai pour l'utiliser.

source: Custom query var slug to use instead of the default.
fr_fr: Personnalise le slug du query_var et remplace celui par défaut.

source: Menu Position
fr_fr: Position dans le menu

source: The position in the menu order the post type should appear. show_in_menu must be true.
fr_fr: La position dans le menu pour ce type d'article. show_in_menu doit être à vrai.

source: See <a href="http://codex.wordpress.org/Function_Reference/register_post_type#Parameters" target="_blank">Available options</a> in the "menu_position" section. Range of 5-100
fr_fr: Consulter <a href="http://codex.wordpress.org/Function_Reference/register_post_type#Parameters" target="_blank">Available options</a> dans la section "menu_position". Gamme de 5-100

source: Show in Menu
fr_fr: Afficher dans le menu

source: Whether to show the post type in the admin menu and where to show that menu.
fr_fr: Dans le cas où l'on affiche ce type d'article dans le menu d'admin et où l'on veut afficher ce menu.

source: "Show UI" must be "true". If an existing top level page such as "tools.php" is indicated for second input, post type will be sub menu of that.
fr_fr: "Générer une interface d'édition" doit être à "vrai". Si une page de niveau supérieur comme "tools.php" est saisie dans le second champ, le type d'article sera un sous-menu de celle-ci.

source: Top-level page file name to make post type a sub-menu of.
fr_fr: Nom du fichier de la page de plus haut niveau afin de lui faire un sous-menu avec ce type d'article.

source: Menu Icon
fr_fr: Icone de menu

source: (Full URL for icon or Dashicon class)
fr_fr: (URL complète pour l'icone ou la classe Dashicon)

source: Image URL or Dashicon class name to use for icon. Custom image should be 20px by 20px.
fr_fr: URL de l'image ou le nom de la classe Dashicon à utiliser pour cette icône. L'image personnalisé devrait être de 20px par 20px.

source: Choose image icon
fr_fr: Choisir une image pour l'icone

source: Title
fr_fr: Titre

source: Adds the title meta box when creating content for this custom post type
fr_fr: Ajoute la méta box Titre lors de la création de contenu pour ce type d'article personnalisé

source: Editor
fr_fr: Editeur

source: Adds the content editor meta box when creating content for this custom post type
fr_fr: Ajoute la méta box Editeur de contenu lors de la création de contenu pour ce type d'article personnalisé

source: Adds the featured image meta box when creating content for this custom post type
fr_fr: Ajoute la méta box Image à la Une lors de la création de contenu pour ce type d'article personnalisé

source: Excerpt
fr_fr: Extrait

source: Adds the excerpt meta box when creating content for this custom post type
fr_fr: Ajoute la méta box Extrait lors de la création de contenu pour ce type d'article personnalisé

source: Trackbacks
fr_fr: Envoyer des rétroliens

source: Adds the trackbacks meta box when creating content for this custom post type
fr_fr: Ajoute la méta box Envoyer des rétroliens lors de la création de contenu pour ce type d'article personnalisé

source: Custom Fields
fr_fr: Champs personnalisés

source: Adds the custom fields meta box when creating content for this custom post type
fr_fr: Ajoute la méta box Champs personnalisés lors de la création de contenu pour ce type d'article personnalisé

source: Comments
fr_fr: Commentaires

source: Adds the comments meta box when creating content for this custom post type
fr_fr: Ajoute la méta box Commentaires lors de la création de contenu pour ce type d'article personnalisé

source: Revisions
fr_fr: Révisions

source: Adds the revisions meta box when creating content for this custom post type
fr_fr: Ajoute la méta box Révisions lors de la création de contenu pour ce type d'article personnalisé

source: Author
fr_fr: Auteur

source: Adds the author meta box when creating content for this custom post type
fr_fr: Ajoute la méta box Auteur lors de la création de contenu pour ce type d'article personnalisé

source: Page Attributes
fr_fr: Attributs de page

source: Adds the page attribute meta box when creating content for this custom post type
fr_fr: Ajoute la méta box Attributs lors de la création de contenu pour ce type d'article personnalisé

source: Post Formats
fr_fr: Formats d'article

source: Adds post format support
fr_fr: Ajoute les formats d'article

source: Use the option below to explicitly set "supports" to false.
fr_fr: Utiliser l'option ci-dessous pour définir explicitement «supports» à faux.

source: None
fr_fr: Aucun

source: Remove all support features
fr_fr: Supprime toutes les fonctionnalités du support

source: Custom "Supports"
fr_fr: "Supports" personnalisés

source: Use this input to register custom "supports" values, separated by commas.
fr_fr: Utiliser cette entrée pour enregistrer les valeurs de "support" personnalisé, séparées par des virgules.

source: Provide custom support slugs here.
fr_fr: Fournit ici des slugs de support personnalisé.

source: Built-in Taxonomies
fr_fr: Taxonomies intégrées

source: Adds %s support
fr_fr: Ajoute le support %s

source: Please provide a post type to delete
fr_fr: Veuillez fournir un type d'article à supprimer

source: Please provide a post type name
fr_fr: Veuillez fournir un nom de type d'article

source: Please do not use quotes in post type names or rewrite slugs
fr_fr: Veuillez ne pas utiliser d'apostrophes dans les noms de type d'article ou les slugs pour les réécritures d'URL

source: Please choose a different post type name. %s is already registered.
fr_fr: Veuillez choisir un autre nom de type d'article. %s est déjà enregistré.

source: Please choose a different post type name. %s matches an existing page slug, which can cause conflicts.
fr_fr: Veuillez choisir un autre nom de type d'article. %s correspond à un slug de page déjà existant, ce qui peut provoquer des conflits.

source: Custom Post Type UI Support
fr_fr: Support Custom Post Type UI

source: Please note that this plugin will NOT handle display of registered post types or taxonomies in your current theme. It will simply register them for you. If all else fails, visit us on the %s
fr_fr: Veuillez noter que ce plugin ne gérera pas l'affichage des types d'article et des taxonomies enregistrés dans votre thème actuel. Il suffit de les enregistrer pour vous. Si tout le reste échoue, visitez le %s

source: Support Forums
fr_fr: Forums de support

source: General
fr_fr: Général

source: I have post types with spaces in their slug and can not successfully delete them. How can I fix that?
fr_fr: J'ai des types d'article avec des espaces dans leur slug et je n'arrive pas à les supprimer avec succès. Comment puis-je résoudre ce problème ?

source: Visit the Import/Export page and copy the export code into the import side on the left. Replace the space with an underscore and then click "Import". You should be able to delete the individual post types afterwards.
fr_fr: Visitez la page Import / Export et copiez le code d'exportation dans le bloc à gauche "Importer les types d'article". Remplacez l'espace par un tiret, puis cliquez sur "Import". Vous devriez être en mesure de supprimer vos types d'article après.

source: I changed my custom post type name and now I can not get to my posts. How do I get them back?
fr_fr: J'ai changé le nom de mon type d'article personnalisé et maintenant je ne peux pas obtenir mes articles. Comment puis-je les récupérer ?

source: You can either change the custom post type name back to the original name or try the Post Type Switcher plugin
fr_fr: Vous pouvez soit changer le nom du type d'article personnalisé en revenant au nom d'origine, soit essayer le plugin Type Switcher

source: I changed my custom post type or taxonomy slug and now I have duplicates shown. How do I remove the duplicate?
fr_fr: Je changé le slug de mon type d'article personnalisé ou de ma taxonomie et maintenant des doublons sont affichés. Comment puis-je supprimer les doublons ?

source: Renaming the slug for a post type or taxonomy creates a new entry in our saved option which gets registered as its own post type or taxonomy. Since the settings will be mirrored from the previous slug, you will just need to delete the previous version's entry.
fr_fr: Renommer le slug pour un type d'article ou une taxonomie crée une nouvelle entrée dans les choix enregistrés avec son propre type d'article ou taxonomie. Étant donné que ses paramètres seront uen copie du slug précédent, vous aurez juste besoin de supprimer les versions des entrées précédentes.

source: I have added post thumbnail and/or post format support to my post type, but those do not appear when adding a post type post.
fr_fr: J'ai ajouté le support d'une image à la Une ou le format d'article pour mon type d'article, mais ceux-là n'apparaissent lors de l'ajout d'un type d'article.

source: Make sure your theme has post "post-thumbnails" theme support enabled.
fr_fr: Assurez-vous que votre thème supporte "post-thumbnails".

source: Do you have any recommendations for an alternative to Visual Composer?
fr_fr: Avez-vous des recommandations à Visual Composer ?

source: We recommend using VelocityPage.
fr_fr: Nous vous recommandons d'utiliser VelocityPage.

source: Is there any way to get CPTUI-registered post types working with Visual Composer Media Grid?
fr_fr: Est-il possible d'obtenir des types d'article enregistrés avec CPTUI qui fonctionnent avec Visual Composer Media Grid ?

source: Please see the solution from the following forum support thread.
fr_fr: Veuillez voir la solution sur un fil du forum de support suivant.

source: Front-end Display
fr_fr: Affichage du front-end

source: What template files should I edit to alter my post type display?
fr_fr: Quels modèles de fichier (template files) dois-je modifier pour modifier l'affichage de mon type d'article ?

source: Please visit the %sTemplate Hierarchy%s page on the WordPress codex for details about available templates.
fr_fr: Veuillez visiter la page %sTemplate Hierarchy%s sur le codex de WordPress pour des explications sur les templates disponibles.

source: How do I display my custom post type on my site?
fr_fr: Comment puis-je afficher mon type d'article personnalisé sur mon site ?

source: You will need to utilize the %sWP_Query%s class to handle display in custom locations. If you have set the post type to have archives, the archive url should be something like "http://www.mysite.com/post-type-slug"
fr_fr: Vous aurez besoin d'utiliser la classe % sWP_Query%s pour gérer l'affichage dans des emplacements personnalisés. Si vous avez configuré le type d'article pour avoir des archives, l'URL de l'archive doit être quelque chose comme "http://www.monsite.fr/post-type-slug"

source: I have added categories and tags to my custom post type, but they do not appear in the archives.
fr_fr: J'ai ajouté des catégories et des mots-clés à mon type d'article personnalisé, mais ils ne n'apparaissent pas dans les archives.

source: You will need to add your newly created post type to the types that the category and tag archives query for. You can see a tutorial on how to do that at %s
fr_fr: Vous aurez besoin d'ajouter votre type d'article nouvellement créé pour les types de requête des archives de catégorie et de mot-clé. Vous pouvez voir un tutoriel sur la façon de le faire sur %s

source: Advanced
fr_fr: Avancé

source: How do I add custom metaboxes to my post type?
fr_fr: Comment puis-je ajouter des métaboxes personnalisés à mon type d'article personnalisé ?

source: We recommend checking out %s, the latest iteration of "Custom Metaboxes and Fields for WordPress". Both are maintained by WebDevStudios.
fr_fr: Nous vous recommandons de vérifier %s, la dernière version de "Custom Metaboxes et Fields for WordPress". Les deux sont supportés par WebDevStudios.

source: How do I add a newly registered taxonomy to a post type that already exists?
fr_fr: Comment puis-je ajouter une taxonomie nouvellement enregistrée à un type d'article qui existe déjà ?

source: Check out the %s function for documentation and usage examples.
fr_fr: Consultez la fonction %s pour la documentation et des exemples d'utilisation.

source: Post relationships?
fr_fr: Les relations d'article ?

source: %s has an excellent %spost%s introducing users to the %sPosts 2 Posts%s plugin that should be a good start.
fr_fr: %s a un excellent %sarticle%s d'introduction aux utilisateurs pour le plugin %sPosts 2 Posts%s qui devrait être un bon début.

source: Is there any function reference list?
fr_fr: Y a-t-il une liste de référence pour les fonctions ?

source: %s has compiled a nice list of functions used by our plugin. Note not all will be useful as they are attached to hooks.
fr_fr: %s a compilé une belle liste de fonctions utilisées par notre plugin. Remarquez que toutes ne seront pas utiles car elles sont attachées à des hooks (crochets).

source: How do I filter the "enter title here" text in the post editor screen?
fr_fr: Comment puis-je filtrer le texte "entrez le titre ici" dans l'écran d'édition de l'article ?

source: Change text inside the post/page editor title field. Should be able to adapt as necessary.
fr_fr: Changer le texte à l'intérieur du champ titre de l'éditeur d'article / page. A adapter selon votre cas.

source: Manage Taxonomies
fr_fr: Gérer les taxonomies

source: Add New Taxonomy
fr_fr: Ajouter une nouvelle taxonomie

source: Edit Taxonomies
fr_fr: Modifier les taxonomies

source: View Taxonomies
fr_fr: Voir les taxonomies

source: Taxonomy Slug
fr_fr: Slug de la taxonomie

source: The taxonomy name/slug. Used for various queries for taxonomy content.
fr_fr: Le slug ou le nom d'une taxonomie. Utilisé dans de nombreuses requêtes pour le contenu d'une taxonomie.

source: DO NOT EDIT the taxonomy slug unless also planning to migrate terms. Changing the slug registers a new taxonomy entry.
fr_fr: NE PAS MODIFIER le slug d'une taxonomie à moins de planifier également une migration des termes. La modification du slug enregistre une nouvelle entrée de taxonomie.

source: Migrate terms to newly renamed taxonomy?
fr_fr: Migrer les termes vers la taxonomie nouvellement renommée ?

source: Attach to Post Type
fr_fr: Attacher au type d'article

source: (e.g. Actors)
fr_fr: (e.g. Acteurs)

source: Used for the taxonomy admin menu item.
fr_fr: Utilisé pour l'item de menu d'administration de la taxonomie.

source: (e.g. Actor)
fr_fr: (e.g. Acteur)

source: Save Taxonomy
fr_fr: Sauvegarder la taxonomie

source: Delete Taxonomy
fr_fr: Supprimer la taxonomie

source: Add Taxonomy
fr_fr: Ajouter la taxonomie

source: Describe what your taxonomy is used for.
fr_fr: Décrit peut-être ce à quoi votre taxonomie est destinée

source: Custom admin menu name for your taxonomy.
fr_fr: Personnaliser le nom du menu dans l'admin pour votre taxonomie

source: (e.g. All Actors)
fr_fr: (e.g. Tous les acteurs)

source: Used as tab text when showing all terms for hierarchical taxonomy while editing post.
fr_fr: Utilisé comme texte d'onglet lorsque l'on affiche tous les termes d'une taxonomie hiérarchique à l'édition de l'article.

source: (e.g. Edit Actor)
fr_fr: (e.g. Modifier acteur)

source: Used at the top of the term editor screen for an existing taxonomy term.
fr_fr: Utilisé en haut de l'écran lors de l'édition d'un terme d'une taxonomie existante.

source: (e.g. View Actor)
fr_fr: (e.g. Voir acteur)

source: Used in the admin bar when viewing editor screen for an existing taxonomy term.
fr_fr: Utilisé dans la barre admin lors de l'édition d'un terme d'une taxonomie existante.

source: (e.g. Update Actor Name)
fr_fr: (e.g. Mettre à jour le nom de l'acteur)

source: Update Item Name
fr_fr: Mettre à jour un nom d'item

source: Custom taxonomy label. Used in the admin menu for displaying taxonomies.
fr_fr: Personnalise le libellé de la taxonomie. Utilisé dans le menu de l'admin pour afficher les taxonomies.

source: (e.g. Add New Actor)
fr_fr: (e.g. Ajouter un nouvel acteur)

source: Used at the top of the term editor screen and button text for a new taxonomy term.
fr_fr: Utilisé en haut de l'écran lors de l'édition et comme de texte de bouton pour un nouveau terme de taxonomie.

source: (e.g. New Actor Name)
fr_fr: (e.g. Nouveau nom d'acteur)

source: New Item Name
fr_fr: Nouveau nom d'item

source: (e.g. Parent Actor)
fr_fr: (e.g. Acteur parent)

source: Parent Item
fr_fr: Item parent

source: (e.g. Parent Actor:)
fr_fr: (e.g. Acteur Parent :)

source: Parent Item Colon
fr_fr: Deux points de l'item parent

source: (e.g. Search Actors)
fr_fr: (e.g. Rechercher des acteurs)

source: Search Items
fr_fr: Rechercher des items

source: (e.g. Popular Actors)
fr_fr: (e.g. Acteurs populaires)

source: Popular Items
fr_fr: Items populaires

source: (e.g. Separate Actors with commas)
fr_fr: (e.g. Acteurs séparés par des virgules)

source: Separate Items with Commas
fr_fr: Les items séparés par des virgules

source: (e.g. Add or remove Actors)
fr_fr: (e.g. Ajouter ou supprimer des acteurs)

source: Add or Remove Items
fr_fr: Ajouter ou supprimer des items

source: (e.g. Choose from the most used Actors)
fr_fr: (e.g. Choisir parmi les acteurs les plus utilisés)

source: Choose From Most Used
fr_fr: Choisir parmi les plus utilisés

source: (e.g. No Actors found)
fr_fr: (e.g. Aucun acteur trouvé)

source: Not found
fr_fr: Pas trouvé

source: (e.g. No actors)
fr_fr: (e.g. Aucun acteur)

source: No terms
fr_fr: Aucun terme

source: Used when indicating that there are no terms in the given taxonomy associated with an object.
fr_fr: Utilisé pour indiquer qu'aucun terme n'existe dans la taxonomie associée à un objet.

source: (e.g. Actors list navigation)
fr_fr: (e.g. Navigation sur la liste des acteurs)

source: Screen reader text for the pagination heading on the term listing screen.
fr_fr: Texte pour les lecteurs d'écran pour la pagination de l'écran qui liste les termes.

source: (e.g. Actors list)
fr_fr: (e.g. Liste des acteurs)

source: Screen reader text for the items list heading on the term listing screen.
fr_fr: Texte pour les lecteurs d'écran pour le titre de la liste des items dans l'écran qui liste les termes.

source: Whether the taxonomy should be publicly queryable.
fr_fr: Si l'on veut que la taxonomie puisse interroger publiquement.

source: Whether the taxonomy can have parent-child relationships
fr_fr: Si l'on veut que la taxonomie puisse avoir des relations parent-enfant.

source: Whether to generate a default UI for managing this custom taxonomy.
fr_fr: Si l'on veut générer une interface d'édition par défaut pour la gestion des taxonomies personnalisées.

source: Sets the query_var key for this taxonomy.
fr_fr: Définit la clé du query_var pour cette taxonomie.

source: (default: taxonomy slug). Query var needs to be true to use.
fr_fr: (Par défaut : le slug de la taxonomie). Variable de query a besoin d'être mis à vrai pour être utilisé.

source: Custom Query Var String
fr_fr: Variable de query personnalisée

source: Sets a custom query_var slug for this taxonomy.
fr_fr: Définit un slug personnalisé pour le query_var de cette taxonomie.

source: Whether or not WordPress should use rewrites for this taxonomy.
fr_fr: Si l'on veut que WordPress utilise ou pas la réécriture pour cette taxonomie.

source: (default: taxonomy name)
fr_fr: (par défaut : le nom de la taxonomie)

source: Custom taxonomy rewrite slug.
fr_fr: Slug pour la réécriture de la taxonomie personnalisée.

source: Rewrite With Front
fr_fr: Rééecriture d'URL avec le front

source: Rewrite Hierarchical
fr_fr: Réécriture d'URL hiérarchique

source: Should the permastruct allow hierarchical urls.
fr_fr: Autoriser les URL hiérarchiques dans la structure des permaliens.

source: Show Admin Column
fr_fr: Afficher la colonne d'admin

source: Whether to allow automatic creation of taxonomy columns on associated post-types.
fr_fr: Si l'on veut permettre la création automatique des colonnes d'une taxonomie sur les types d'article associés.

source: Whether to show this taxonomy data in the WP REST API.
fr_fr: Si l'on veut afficher les données de cette taxonomie dans l'API WP REST.

source: Show in quick/bulk edit panel.
fr_fr: Afficher dans le panneau d'édition quick/bulk.

source: Whether to show the taxonomy in the quick/bulk edit panel.
fr_fr: Si l'on veut afficher la taxonomie dans le panneau d'édition quick/bulk.

source: Please provide a taxonomy to delete
fr_fr: Veuillez fournir une taxonomie à supprimer

source: Please provide a taxonomy name
fr_fr: Veuillez fournir un nom de taxonomie

source: Please provide a post type to attach to.
fr_fr: Veuillez fournir un type d'article à lui attacher.

source: Please do not use quotes in taxonomy names or rewrite slugs
fr_fr: Veuillez ne pas utiliser les apostrophes dans les noms de taxonomie ou les slugs des réécriture d'URL

source: Please choose a different taxonomy name. %s is already registered.
fr_fr: Veuillez choisir un nom de taxonomie différent. %s est déjà enregistré.

source: About
fr_fr: A propos

source: Help
fr_fr: Aide

source: %s version %s by %s
fr_fr: %s version %s par %s

source: Support forums
fr_fr: Forums de support

source: Follow on Twitter:
fr_fr: Suivez-nous sur Twitter :
